


# dz

# keyboard
# Задание 1. 
# игра кликер
# если пользователь зажмет комбинацию клавиш, то появляется меню настроек
# в настройках можно менять фон кнопки и окна , размер кнопки и окна
# размер кнопки и окна меняется в режиме реального времени
# при отжатии комбинации клавиш меню исчезает
# Подсказка пользователь вводит ширину и высоту в отдельные entry



# mouse
# Задание 2. 
# сделать калькулятор через bind




# canvas
# Задание 1. 
# нарисовать картинку по своему усмотрению 
# пример: картинка с горами солнцем , морем и небом

# Задание 2. 
# нарисовать смайлик пример: 🙂

# Задание 3.
# до делать робота 

# Задание 4.
# нарисовать прямую по формуле

# Задание 5.
# нарисовать параболу по формуле







# canvas (2)
# Задание 6. 
# пользовотель вводит текст его нужно отрисовать в рамке с эфектом тени
# отрисовка должна быть с каждым новым введенным символом

# Задание 7.
# нарисовать дугу и создать два scale
# первый scale меняет start дуги
# второй scale меняет extent дуги

# Задание 8.
# создать в canvas окно с кнопкой кликер
# окно при зажатии можно перетаскивать







# canvas (3)
# Задание 9(повтор).
# создать в canvas окно с кнопкой кликер
# окно при зажатии можно перетаскивать

# Задание 10.
# создать окно с круглой загрузкой (желательно оформить красиво)

