


# dz

# keyboard
# Задание 1. 
# игра кликер
# если пользователь зажмет комбинацию клавиш, то появляется меню настроек
# в настройках можно менять фон кнопки и окна , размер кнопки и окна
# размер кнопки и окна меняется в режиме реального времени
# при отжатии комбинации клавиш меню исчезает
# Подсказка пользователь вводит ширину и высоту в отдельные entry



# mouse
# Задание 2. 
# сделать калькулятор через bind




# canvas
# Задание 1. 
# нарисовать картинку по своему усмотрению 
# пример: картинка с горами солнцем , морем и небом

# Задание 2. 
# нарисовать смайлик пример: 🙂

# Задание 3.
# до делать робота 

# Задание 4.
# нарисовать прямую по формуле

# Задание 5.
# нарисовать параболу по формуле

