
# типы
# print(type("3.0"))



# тип переменной
# num = 2
# print(type(num))



# тип типа
# num_type = type(num)
# print(type(num_type))



# num_2 = 4
# num_str_2 = str(num_2)
# print("num_2 =" ,num_2)
# print(type(num_2))
# print("-----------")
# print("num_str_2 =" ,num_str_2)
# print(type(num_str_2))



# преобразование int в float
# num_3 = 6
# num_str_3 = float(num_3)
# print("num_3 =" ,num_3)
# print(type(num_3))
# print("-----------")
# print("num_str_3 =" ,num_str_3)
# print(type(num_str_3))



# преобразование float в int
# num_4 = 6.7
# num_str_4 = int(num_4)
# print("num_4 =" ,num_4)
# print(type(num_4))
# print("-----------")
# print("num_str_4 =" ,num_str_4)
# print(type(num_str_4))



# преобразование строки в число 
# num_5 = "8"
# num_int_5 = int(num_5)
# print("num_5 =" ,num_5)
# print(type(num_5))
# print("-----------")
# print("num_int_5 =" ,num_int_5)
# print(type(num_int_5))



# преобразование int в bool
# num_6 = -10
# num_bool_6 = bool(num_6)
# print("num_6 =" ,num_6)
# print(type(num_6))
# print("-----------")
# print("num_bool_6 =" ,num_bool_6)
# print(type(num_bool_6))



# преобразование bool в int
# num_7 = False
# num_int_7 = int(num_7)
# print("num_7 =" ,num_7)
# print(type(num_7))
# print("-----------")
# print("num_int_7 =" ,num_int_7)
# print(type(num_int_7))



# ввод данных
# num_inp_1 = input("==>")
# print("num_inp_1 =" , num_inp_1)
# print(type(num_inp_1))



# ввод данных и преобразование в число
# num_inp_2 = input("==>")
# anwser_2 = int(num_inp_2)
# print("ответ: " , anwser_2 * 12)


# тоже самое но короче 
# num_inp_3 = int(input("==>"))
# print("ответ: " , num_inp_3 * 12)



# вывод символа из строки
# str_1 = "q🐪werty"
# print(str_1)
# print(str_1[1] , str_1[5])
# sumbol =  str_1[1] + str_1[5] + "*123"
# print(sumbol)



# спецсимвол
# print("1qewe ' ee")
# print("1qewe \" ee")
# print("1qewe \n ee")
# print("1qewe \t ee")




# задача 1
# Написать программу вычисления расстояния 
# между двумя точками.

# Задание 2
# Написать программу вычисления объема параллелепипеда. Ниже приведен рекомендуемый вид экрана 
# во время выполнения программы.
# Вычисление объема параллелепипеда.
# Введите исходные данные:
# Длина (см) -> 9;
# Ширина (см) -> 7.5;
# Высота (см) -> 5;
# Объем: 337.50 куб. см.

# Задание 3
# Зарплата менеджера — 100$ + 5% от продаж. 
# Пользователь вводит с клавиатуры общую сумму сделок менеджера за месяц. 
# Посчитать итоговую зарплату менеджера.

# задача 4 (повтор)
# Пользователь вводит с клавиатуры денежную 
# сумму в рублях и копейках (рубли и копейки вводятся 
# в разные переменные). Сумма может быть введена как 
# правильно (например 19 руб. 90 коп), так и неправильно 
# (например 22 руб. 978 коп). Написать программу, которая, 
# используя только линейный алгоритм, осуществит корректировку введенной денежной суммы в правильную форму.
# Например, если пользователь ввел 11 руб. 150 коп, 
# программа должна вывести на экран сумму 12 руб. 50 копю


