
# вывод
# print("hello world")
# print('text')
# print(12)



# создание и вывод переменной
# num = 2
# print(num)



# пример названия переменных
# red_car = 9
# redCar = 9
# redCarSuper = 9



# работа с переменной
# num_2 = 6
# print(2 + 2)
# print(2 + num_2)




# вывод нескольких значений и переменных
# print("hello" , 4 , num_2)



# арифметические операторы
# print("5 + 2 =" , 5 + 2)
# print("5 - 2 =" , 5 - 2)
# print("3 * 2 =" , 3 * 2)
# print("3 ** 2 =" , 3 ** 2)
# print("10 / 3 =" , 10 / 3)
# print("10 // 3 =" , 10 // 3)
# print("10 % 3 =" , 10 % 3)



# создание переменной
# num_3 = 5 + 2 
# print(num_3)

# перезапись переменной
# num_3 = 2
# print(num_3)

# изменение переменной
# num_3 = num_3 + 3
# print(num_3)



# типы данных
# num_int = 4 # int - Целые числа
# num_float = 5.7 # float - Числа с плавающей точкой
# num_str = "w1e2r" # str - Строка
# num_bool = False # boot - Логические значения
# num_none = None # NoneType - Ничего


# print("int =" , num_int)
# print("float =" , num_float)
# print("str =" , num_str)
# print("bool =" , num_bool)
# print("none =" , num_none)



# сложение строки
# num_str = "svg" + "90 " +"w"
# print(num_str)



# умножение строки
# print("svg-" * 4)







# dz
# задача 1
# Дана диагональ телевизора в дюймах. Написать программу, определяющую эту же диагональ в сантиметрах 
# (1 дюйм = 2.54 сантиметров).

# задача 2
# Емкость аккумулятора смартфона составляет N мАч. 
# Написать программу, определяющую минимальную 
# емкость переносного зарядного устройства (powerbank), 
# если необходимо 3 полных заряда смартфона.

# задача 3
# За один день хомячок съедает K грамм корма. 
# Написать программу, определяющую закупку корма в килограммах на 30 дней.

# задача 4 
# Дана денежная сумма в рублях и копейках (рубли и копейки вводятся 
# в разные переменные). Сумма может быть введена как 
# правильно (например 19 руб. 90 коп), так и неправильно 
# (например 22 руб. 978 коп). Написать программу, которая, 
# используя только линейный алгоритм, осуществит корректировку введенной денежной суммы в правильную форму.
# Например, если пользователь ввел 11 руб. 150 коп, 
# программа должна вывести на экран сумму 12 руб. 50 копю

# задача 5
# Дано время в секундах, прошедшее с начала дня. Вывести на экран 
# текущее время в часах, минутах и секундах. Посчитать, 
# сколько часов, минут и секунд осталось до полуночию

# задача 6
# Даны три числа. 
# Посчитать их сумму, произведение и среднее арифметическое.

