

# условие
# print("start_x")
# if(True):
#     print("ok")
# print("end_x")



# условие не работает
# print("start_x")
# if(False):
#     print("ok")
# print("end_x")




# сохраняем bool
# num_bool = False
# if(num_bool):
#     print("ok")




# сравнение
# print(2 == 2)
# if(2 == 2):
#     print("yes")




# Логические операторы:
# print("3 == 3 :" , 3 == 3) # ровно
# print("3 != 3 :" , 3 != 3) # неровно
# print("4 < 3 :" , 4 < 3) # меньше 
# print("4 > 3 :" , 4 > 3) # больше 
# print("4 <= 3 :" , 4 <= 3) # меньше и ровно
# print("4 >= 3 :" , 4 >= 3) # больше и ровно




# пример с логическими операторами
# num = 11
# if(num < 10):
#     print("< 10")




# иначе
# num_2 = 3
# if(num_2 < 10):
#     print("< 10")
# else:
#     print("not")




# вложенные условия
# num_3 = 8
# if(num_3 < 20):
#     print("num_3 < 20")
#     if(num_3 == 25):
#         print("num_3 == 5")
    



# Логические операторы and и or
# print(True and True)
# print(True and False)


# print(True or True)
# print(True or False)
# print(False or False)


# print((True or False) and (True or False))



# пример с and
# num_4 = 16
# if(num_4 > 10 and num_4 < 20):
#     print("ok")




num_5 = 50
# if(num_5 < 20):
#     print("num_5 < 20")
# if(num_5 != 10):
#     print("num_5 != 10")
# if(num_5 == 3):
#     print("num_5 == 3")




# цепочка условий 
# if(num_5 < 20):
#     print("num_5 < 20")
# elif(num_5 != 10):
#     print("num_5 != 10")
# elif(num_5 == 3):
#     print("num_5 == 3")
# else:
#     print("not")










# dz:
# Задание 1. Пользователь вводит число. Определить, является ли оно четным.

# Задание 2. Пользователь вводит два числа. Вывести на 
# экран меньшее из этих чисел. 

# Задание 3. Пользователь вводит число. Определить, положительное это число, отрицательное или равно нулю.

# Задание 4. Пользователь вводит два числа. Определить, 
# равны ли эти числа, и если нет, вывести их на экран в порядке возрастания

# Задание 5. Пользователь с клавиатуры вводит 5 оценок 
# студента. Определить, допущен ли студент к экзамену. 
# Студент получает допуск, если его средний балл 3 балла 
# и выше.

# Задание 6. Пользователь вводит с клавиатуры число. Если 
# оно четное, умножить его на три, иначе — поделить на 
# два. Результат вывести на экран.

# Задание 7. Написать программу-калькулятор. Пользователь 
# вводит два числа и выбирает арифметическое действие. 
# Вывести на экран результат
